Revit 2027 API
PanelScheduleView.GetSpareCurrentValue Method
 Gets the value of the apparent current parameter for a spare
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetSpareCurrentValue(
	int row,
	int column,
	ElementId idCurrentParameter
)
Public Function GetSpareCurrentValue (
	row As Integer,
	column As Integer,
	idCurrentParameter As ElementId
) As Double
public:
double GetSpareCurrentValue(
	int row,
	int column,
	ElementId^ idCurrentParameter
)
member GetSpareCurrentValue :
        row : int *
        column : int *
        idCurrentParameter : ElementId -> float
Parameters
row Int32
 A row where the valid spare is
column Int32
 A column where the valid spare is
idCurrentParameter ElementId
 One of 4 valid current parameters: RBS_ELEC_APPARENT_CURRENT_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEA_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEB_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEC_PARAM
Return Value
Double
 The value of the spare's current parameter
Exceptions
Exception | Condition
ArgumentException |  The current parameter id is not valid.
ArgumentNullException |  A non-optional argument was null
ArgumentsInconsistentException |  The row column combination does not represent a valid spare.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace